---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.MetalResistanceCalculationStrength
source: html/07acf37d-c8ea-cacd-ee26-59e37c2a410e.htm
---
# Autodesk.Revit.DB.StructuralAsset.MetalResistanceCalculationStrength Property

The resistance calculation strength of the asset.

## Syntax (C#)
```csharp
public double MetalResistanceCalculationStrength { get; set; }
```

## Remarks
Applies to metal-based structural assets.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - When setting this property: the material type must be Metal to set this property.